{
  "title": "Balsamic Chicken Skillet",
  "slug": "balsamic-chicken-skillet",
  "rating": "6",
  "notes": [
    "chicken breasts, don't use pre-slice mozz, need really thin slices"
  ],
  "source": "https://www.budgetbytes.com/2016/08/balsamic-chicken-skillet/",
  "ingredients": [
    {
      "quantity": "2 Tbsp",
      "name": "olive oil "
    },
    {
      "quantity": "2 Tbsp",
      "name": "brown sugar "
    },
    {
      "quantity": "1/4 cup",
      "name": "balsamic vinegar "
    },
    {
      "quantity": "1 Tbsp",
      "name": "soy sauce "
    },
    {
      "quantity": "2 cloves",
      "name": "garlic, minced"
    },
    {
      "quantity": "",
      "name": "Freshly cracked pepper "
    },
    {
      "quantity": "6",
      "name": "boneless, skinless chicken thighs"
    },
    {
      "quantity": "4 oz.",
      "name": "whole milk mozzarella "
    },
    {
      "quantity": "2",
      "name": "Roma tomatoes "
    },
    {
      "quantity": "1/4",
      "name": "bunch fresh parsley "
    }
  ],
  "instructions": [
    "Prepare the marinade by stirring together the olive oil, brown sugar, balsamic vinegar, soy sauce, minced garlic, and some freshly cracked pepper (about 10-15 cranks of a pepper mill).",
    "Place the chicken thighs in a gallon-size zip top bag or a shallow dish and pour the marinade over top. Stir to coat the chicken in the marinade. Marinate the chicken in the refrigerator for 30 minutes to 8 hours, turning occasionally to redistribute the marinade.",
    "When ready to cook the chicken, heat a large skillet over medium flame. When the skillet is hot, carefully take the chicken thighs out of the marinade and place them in the hot skillet. Cook the chicken thighs until cooked through and browned on each side (about 5 minutes each side). While the chicken is cooking, slice the mozzarella into six pieces, slice the tomatoes (at least 12 slices), and roughly chop the parsley.",
    "Once the chicken is cooked through, remove it to a clean plate. Pour the remaining marinade into the skillet and let it boil over medium heat, stirring often, until it has reduced to a thick and rich glaze.",
    "Turn the heat under the skillet down to medium-low, return the chicken to the skillet, and spoon some of the glaze over each piece. Place a slice of mozzarella on top of each piece of chicken, followed by two slices of tomato. Place a lid on the skillet and let it heat through until the mozzarella is melted. Top the chicken with the chopped fresh parsley, then serve."
  ]
}