{
  "title": "Balsamic Chicken and Mushrooms",
  "slug": "balsamic-chicken-and-mushrooms",
  "rating": 7,
  "notes": [
    ""
  ],
  "source": "https://www.budgetbytes.com/balsamic-chicken-and-mushrooms/",
  "ingredients": [
    {
      "quantity": "4 Tbsp",
      "name": "balsamic vinegar"
    },
    {
      "quantity": "1.5 Tbsp",
      "name": "soy sauce"
    },
    {
      "quantity": "1 Tbsp",
      "name": "brown sugar"
    },
    {
      "quantity": "2 cloves",
      "name": "garlic, minced"
    },
    {
      "quantity": "1/4 tsp",
      "name": "dried thyme"
    },
    {
      "quantity": "4",
      "name": "boneless, skinless chicken thighs (about 1.25 lbs. total)"
    },
    {
      "quantity": "1 pinch",
      "name": "salt and pepper"
    },
    {
      "quantity": "1 Tbsp",
      "name": "olive oil"
    },
    {
      "quantity": "8 oz.",
      "name": "mushrooms"
    },
    {
      "quantity": "2 Tbsp",
      "name": "butter"
    }
  ],
  "instructions": [
    "Prepare the balsamic sauce first. In a small bowl, stir together the balsamic vinegar, soy sauce, brown sugar, minced garlic, and dried thyme. Set the sauce aside.",
    "Season the chicken thighs with a pinch of salt and pepper on each side.",
    "Heat a large skillet over medium. Once hot, add the olive oil and swirl to coat the surface. Add the chicken thighs to the skillet and cook on each side until browned and cooked through (about 8 minutes first side, 5 minute second side). Remove the chicken to a clean plate and cover to keep warm.",
    "While the chicken is cooking, clean the mushrooms and then slice them in half. After removing the chicken from the skillet, add the mushrooms in their place, and sauté in the remaining oil and fat until the mushrooms are slightly tender and browned on the outside (5-7 minutes).",
    "Turn the heat down to medium-low. Add the prepared balsamic sauce to the skillet and stir to dissolve any browned bits from the bottom of the skillet. Allow the sauce to come up to a simmer. Simmer the balsamic sauce with the mushrooms, stirring occasionally, for about 5 minutes, or until the sauce has reduced by half.",
    "Add the butter to the skillet and stir until it is melted into the sauce. Add the chicken back to the skillet, turning it to coat in the sauce, and allow it to simmer for a few minutes more to rewarm the chicken. Serve hot and drizzle the pan sauce over the chicken and mushrooms."
  ]
}