{
  "title": "Quick Beef Pepper Steak Meal Prep",
  "rating": 5,
  "slug": "beef-pepper-steak-meal-prep",
  "notes": [
    "Steak and peppers are good, I forgot how nasty arrowroot starch is lol"
  ],
  "createdDate": "06/16/2020",
  "source": "https://fitmencook.com/beef-pepper-steak/",
  "image": "../images/quick-beef-pepper-steak-meal-prep.jpg",
  "ingredients": [
    {
      "category": "All",
      "items": [
        "3 large bell peppers, chopped (I used 3 different colors)",
        "1 lb beef flank (OR skirt steak), chopped into 1-inch pieces",
        "1 tablespoon avocado oil",
        "1 tablespoon garlic, fresh",
        "1/2 cup onion, diced",
        "1 1/2 tablespoons arrowroot",
        "3 tablespoons low sodium soy sauce",
        "4oz low sodium beef broth",
        "2 teaspoons coconut sugar",
        "2 teaspoons sesame oil",
        "2 tablespoon Sriracha (or more/less to taste)",
        "1 tablespoon sesame seeds"
      ]
    }
  ],
  "instructions": [
    "Mix together the ingredients for the sauce, and set aside.",
    "Set a skillet on HIGH heat.  Once hot, lightly spray with avocado oil, then add bell peppers.  Allow them to rest in the skillet (without agitating) for 1 minute or until the outside becomes seared and begins to blister.  Then stir for 1 additional minute and remove from the skillet.",
    "Place the skillet back on HIGH heat, then add the beef.  All it to rest in the skillet until 1 side begins to sear, then begin stirring for 1 additional minute and remove from the skillet.",
    "Reduce the heat of the skillet to medium high.  Once the skillet has cooled down, add the avocado oil, garlic and onions.  Caramelize until the onions turn brown and translucent, about 2 minutes.  Then add  both the beef and peppers back to the skillet.  Mix together for 1 minute.",
    "Make a hole in the skillet.  Pour in the sauce.  As soon  as it starts to bubble and turn shiny, remove from the skillet from the heat and STIR QUICKLY so the sauce doesn’t clump or become slimy.",
    "Mix and fold everything. Garnish with sesame seeds and enjoy!"
  ],
  "servings": 4
}