{
  "title": "Beef Kofta Meatballs with Roasted Vegetables",
  "slug": "beef-kofta-meatballs-with-roasted-vegetables",
  "rating": 7,
  "notes": [
    ""
  ],
  "source": "https://www.budgetbytes.com/beef-kofta-meatballs-with-roasted-vegetables/",
  "ingredients": [
    {
      "quantity": "1",
      "name": "zucchini"
    },
    {
      "quantity": "1",
      "name": "yellow squash"
    },
    {
      "quantity": "1 pint",
      "name": "grape tomatoes"
    },
    {
      "quantity": "3/4",
      "name": "red onion"
    },
    {
      "quantity": "2 Tbsp",
      "name": "olive oil"
    },
    {
      "quantity": "1/4 tsp",
      "name": "garlic powder"
    },
    {
      "quantity": "1/2 tsp",
      "name": "dried oregano"
    },
    {
      "quantity": "",
      "name": "salt & pepper"
    },
    {
      "quantity": "1 lb.",
      "name": "ground beef"
    },
    {
      "quantity": "2 cloves",
      "name": "garlic, minced"
    },
    {
      "quantity": "1/4",
      "name": "red onion, minced"
    },
    {
      "quantity": "2 Tbsp",
      "name": "parsley, chopped"
    },
    {
      "quantity": "1/2 tsp",
      "name": "dried oregano"
    },
    {
      "quantity": "1/4  tsp ",
      "name": "cumin"
    },
    {
      "quantity": "1/8 tsp",
      "name": "cinnamon"
    },
    {
      "quantity": "1/8 tsp",
      "name": "cloves"
    },
    {
      "quantity": "3/4 tsp",
      "name": "salt"
    },
    {
      "quantity": "2 Tbsp ",
      "name": "cooking oil"
    },
    {
      "quantity": "4 cups",
      "name": "cooked rice"
    },
    {
      "quantity": "2 Tbsp ",
      "name": "parsley, chopped, for garnish"
    }
  ],
  "instructions": [
    "Preheat the oven to 425ºF. Dice the zucchini and yellow squash. Reserve 1/4 of the red onion for the meatballs and cut the remaining 3/4 into 1-inch slices. Place the chopped zucchini, squash, onion, and grape tomatoes on a large baking sheet.",
    "Drizzle the olive oil over the vegetables, then add the garlic powder, oregano, salt and pepper. Use your hands to toss the vegetables in the oil and spices until they are evenly coated. Spread the vegetables out evenly over the baking sheet, then transfer them to the oven.",
    "Roast the vegetables in the oven for 40 minutes, or until they are wilted and browned on the edges, stirring once half way through.",
    "While the vegetables are roasting, prepare the meatballs. Mince the remaining 1/4 red onion. Add the ground beef, red onion, minced garlic, chopped parsley, oregano, cumin, cloves, cinnamon, and salt to a bowl. Mix the ingredients together until they are well combined.",
    "Shape the meat mixture into 16 ping pong sized meatballs. This is a good time to begin cooking your rice so that it's finished at the same time as the meatballs and vegetables.",
    "Heat a large non-stick or cast iron skillet over medium heat. Once hot, 1 Tbsp cooking oil and swirl to coat the surface of the skillet. Add half of the meatballs and cook on each side until well browned (about 7 minutes total). Be careful as you turn the meatballs, as they can be quite delicate. If it's easier, you can flatten them into mini patty shapes. Transfer the cooked meatballs to a clean plate, add more oil to the skillet, and cook the second batch in the same manner.",
    "Once the meatballs are cooked and the vegetables have finished roasting, it's time to assemble the meal. Place about 1 cup cooked rice on each plate or container, add 1/4 of the roasted vegetables, then top with four of the beef kofta meatballs. Top with a little more chopped parsley and enjoy!"
  ]
}