{
  "title": "Chicken Pot Pie",
  "slug": "chicken-pot-pie",
  "rating": 8,
  "notes": [
    "I ended up adding about another 1/4 cup of half and half",
    "let the pie crust come to room temperature before handling"
  ],
  "createdDate": "12/30/2018",
  "source": "https://girlwiththeironcast.com/chicken-pot-pie/",
  "time": [
    {
      "label": "Prep",
      "units": "15 minutes"
    },
    {
      "label": "Cook",
      "units": "55 minutes"
    },
    {
      "label": "Total time",
      "units": "1 hour 10 minutes"
    }
  ],
  "image": "../images/chicken-pot-pie.jpg",
  "ingredients": [
    {
      "category": "All",
      "items": [
        "1 lb boneless, skinless chicken breast, cut into bite size cubes",
        "2 tbsp olive oil",
        "2 tsp of adobo seasoning for chicken",
        "2 medium carrots, peeled & diced (1 cup)",
        "3/4 lb yukon gold potatoes, peeled & diced (2 cups)",
        "2 cloves garlic, minced (1 tbsp)",
        "3 tbsp unsalted butter",
        "1 tbsp better than bouillon paste",
        "1 tsp dried thyme",
        "1/4 tsp + 1/4 tsp fresh ground black pepper",
        "2 tbsp fresh parsley, chopped",
        "3/4 cup low sodium chicken broth",
        "1/2 cup 2% milk",
        "1/3 cup all purpose flour",
        "1/2 cup frozen peas",
        "2 pre-made pie crusts, room temperature",
        "1 egg, whisked + 1 tbsp water for egg wash"
      ]
    }
  ],
  "instructions": [
    "Preheat oven to 375 degrees F",
    "In a large cast iron (or regular skillet) over medium high heat, add 2 tbsp of olive oil and the chicken. Add seasoning and brown chicken till fully cooked through. Remove from skillet and set aside.",
    "Lower the heat to medium, add 3 tbsp of butter, carrots, potatoes, garlic, thyme, 1/4 tsp black pepper and bouillon paste. Sauté for about 8 minutes until carrots and potatoes begin to soften (you can cover with foil/lid to assist). Add back into the skillet the chicken, add the frozen peas, and fresh parsley, stir to combine everything.",
    "Sprinkle the flour over the mixture and carefully mix. Once flour is mixed in, add the milk and the chicken broth and carefully mix all the ingredients. Bring to a soft boil, about 5 minutes. Once the mixture reaches a boil, lower the heat to simmer and gently stir until sauce thickens, 3-4 minutes. Remove from heat.",
    "In a 9 inch pie dish, spray some non-stick cooking spray, and gently roll your pie crust into the pie dish. Gently press the dough into the dish to ensure it’s evenly spread and reaching to the ends of the pie dish (you may trim the ends hanging off if needed). Add the pie filling to the dish. Take your second pie dough and carefully roll it over the filling. Using a fork or your fingers, press the edges of the pie dough down so it seals the edges. ",
    "In a small bowl whisk the egg and 1 tbsp of water. Using a brush, carefully brush the entire top of the pie dough with the egg wash. Using a knife, cut a “+” in the middle of the pie as a vent to allow the steam to escape. Sprinkle a little salt and fresh ground pepper on top of the dough. ",
    "Bake for 30-35 minutes until the pie crust is golden brown. Remove from the oven and allow to cool for 10 minutes before serving."
  ],
  "servings": 7
}