{
  "title": "Classic Baked Ziti",
  "slug": "classic-baked-ziti",
  "image": "../images/classic-baked-ziti.jpg",
  "rating": 7,
  "notes": [
    "Good feel good food that lasts a while"
  ],
  "createdDate": "04/20/2020",
  "source": "https://www.budgetbytes.com/classic-baked-ziti/",
  "ingredients": [
    {
      "category": "All",
      "items": [
        "1 lb. Italian sausage (sweet, mild, or hot)",
        "1 yellow onion",
        "3 oz. tomato paste",
        "1 28 oz. can crushed tomatoes",
        "1 Tbsp Italian seasoning blend",
        "1/2 cup water",
        "1 lb. ziti",
        "1/2 Tbsp salt (for pasta water)",
        "15 oz. ricotta",
        "1 cup Italian cheese blend*",
        " freshly cracked black pepper",
        "2  cups  shredded mozzarella",
        "1 handful chopped parsley (optional, for garnish)"
      ]
    }
  ],
  "instructions": [
    "Brown the sausage in a large skillet or pot over medium heat, until it's brown and crispy on the edges (pork sausage contains a lot of fat, so I didn't add any extra to the skillet).",
    "While the sausage is browning, finely dice the onion. Add the onion to the skillet once the sausage has browned, and continue to sauté over medium heat until the onion is soft and translucent.",
    "Add the tomato paste, crushed tomatoes, Italian seasoning, and 1/2 cup water to the skillet with the sausage and stir to combine. Place a lid on the skillet and allow it to come up to a simmer. Once simmering, turn the heat down and allow it to continue to simmer while you cook the ziti. Stir the sauce occasionally as it simmers.",
    "After getting the sauce started, begin the ziti. Bring a large pot of water with 1/2 Tbsp salt to a boil over high heat. Once boiling, add the ziti, and let it continue to boil until the ziti is tender (about 7-8 minutes). Drain the ziti in a colander. Shake the colander a bit to shake excess water out of the pasta.",
    "While the pasta and sauce are cooking, prepare the cheese filling. Add the ricotta, Italian cheese blend, and some freshly cracked black pepper (about 10 cranks of a pepper mill) to a bowl and stir to combine. Begin to preheat the oven to 350ºF.",
    "After draining the ziti, return it to the pot and add 1 cup of the red sauce. Stir to coat the cooked pasta in sauce.",
    "Pour half of the ziti to a 9x13\" baking dish. Add half of the ricotta mixture on top of the ziti in small dollops. Finally, spoon half of the red sauce and sausage over the pasta and ricotta. It's okay if the ingredients don't cover in a solid layer. Repeat these layers with the second half of the pasta, ricotta mixture, and sauce. Finally, top with 2 cups shredded mozzarella.",
    "Cover the baking dish with foil, making sure it's slightly tented so that it doesn't touch or stick to the melted cheese. Transfer the covered casserole to the oven and bake for 20 minutes. ",
    "After baking for 20 minutes, remove the foil, and turn the oven on to broil (keep the casserole on the middle rack, about 10-12 inches from the broiler). Broil for 5 minutes, or just until the cheese is slightly browned. Keep a close eye on the baked ziti as it broils, because broilers can vary in intensity. Top with chopped parsley, if desired, then serve."
  ],
  "servings": 8,
  "time": [
    {
      "label": "Prep",
      "units": "10 minutes"
    },
    {
      "label": "Cook",
      "units": "55 minutes"
    },
    {
      "label": "Total",
      "units": "5 minutes"
    }
  ]
}