{
  "title": "Easy Homemade Orange Chicken",
  "rating": "8",
  "notes": [
    "dank asf with chicken breasts"
  ],
  "source": "https://www.budgetbytes.com/2017/02/easy-orange-chicken/",
  "ingredients": [
    {
      "quantity": "1",
      "name": "large orange"
    },
    {
      "quantity": "3 Tbsp",
      "name": "soy sauce"
    },
    {
      "quantity": "1.5 Tbsp",
      "name": "brown sugar"
    },
    {
      "quantity": "1/2 Tbsp",
      "name": "rice vinegar"
    },
    {
      "quantity": "1 tsp",
      "name": "grated fresh ginger"
    },
    {
      "quantity": "1 clove",
      "name": "garlic, minced"
    },
    {
      "quantity": "1/4 tsp",
      "name": "red pepper flakes"
    },
    {
      "quantity": "1/2 Tbsp",
      "name": "cornstarch"
    },
    {
      "quantity": "4",
      "name": "boneless, skinless chicken thighs (about 1.3 lbs.)"
    },
    {
      "quantity": "1",
      "name": "large egg"
    },
    {
      "quantity": "2 Tbsp",
      "name": "cornstarch"
    },
    {
      "quantity": "",
      "name": "Pinch of salt and pepper"
    },
    {
      "quantity": "2 Tbsp",
      "name": "cooking oil"
    },
    {
      "quantity": "4 cups",
      "name": "cooked rice"
    },
    {
      "quantity": "2",
      "name": "green onions, sliced"
    }
  ],
  "instructions": [
    "Remove the zest from the orange using a zester or small-holed cheese grater, then squeeze the juice from the orange. You'll need about 1 tsp zest and 1/2 cup juice. Combine the juice and 1 tsp zest with the soy sauce, brown sugar, rice vinegar, grated ginger, minced garlic, red pepper flakes, and 1/2 Tbsp cornstarch in a small sauce pot. Before placing it over heat, whisk until the cornstarch is fully dissolved. Heat the mixture over medium-low until it begins to simmer, thicken, and turns into a glossy glaze (about 3-5 minutes). Remove the sauce from heat and set it aside.",
    "Use a sharp knife to remove any excess fat from the chicken thighs, then cut them into small 3/4-inch pieces.",
    "Combine the egg, 2 Tbsp cornstarch, and a pinch of salt and pepper in a mixing bowl and whisk until the mixture is smooth and frothy. Add the chicken pieces and stir to coat them in the egg mixture.",
    "Heat a large skillet over medium to medium-high heat. Once hot, add 2 Tbsp cooking oil and swirl to coat the bottom of the skillet. Add the chicken, making sure all the pieces are touching the surface and not piled on top of one another. Let the pieces cook until they are golden brown on the bottom.",
    "Flip the chicken pieces, breaking them apart from one another as you turn them. Let them cook until golden brown on the second side and cooked through (about 5-7 minutes total cooking).",
    "Turn the heat off under the skillet and pour on the prepared orange sauce. Stir to coat the chicken pieces in sauce.",
    "Serve the chicken and sauce over cooked rice, garnished with sliced green onions and any left over orange zest."
  ]
}