{
  "title": "Easy Oven Fajitas",
  "slug": "easy-oven-fajitas",
  "rating": "7",
  "notes": [
    ""
  ],
  "source": "https://www.budgetbytes.com/2013/02/oven-fajitas/",
  "ingredients": [
    {
      "quantity": "1 Tbsp",
      "name": "chili powder"
    },
    {
      "quantity": "1/2 Tbsp",
      "name": "paprika"
    },
    {
      "quantity": "1/2 tsp",
      "name": "onion powder"
    },
    {
      "quantity": "1/4 tsp",
      "name": "garlic powder"
    },
    {
      "quantity": "1/4 tsp",
      "name": "cumin"
    },
    {
      "quantity": "1/8 tsp",
      "name": "cayenne pepper"
    },
    {
      "quantity": "1 tsp",
      "name": "sugar"
    },
    {
      "quantity": "1/2 tsp",
      "name": "salt"
    },
    {
      "quantity": "2",
      "name": "small or 1 large onion"
    },
    {
      "quantity": "3",
      "name": "bell peppers, any color"
    },
    {
      "quantity": "1 lb.",
      "name": "chicken breast*"
    },
    {
      "quantity": "2 Tbsp",
      "name": "vegetable oil"
    },
    {
      "quantity": "1",
      "name": "medium lime"
    },
    {
      "quantity": "8",
      "name": "6-inch tortillas"
    },
    {
      "quantity": "1/2 cup",
      "name": "sour cream (optional)"
    },
    {
      "quantity": "1/4 bunch",
      "name": "cilantro (optional)"
    }
  ],
  "instructions": [
    "Preheat the oven to 400 degrees. Mix all of the spices for the fajita seasoning in a small bowl and set aside (chili powder, paprika, onion powder, garlic powder, cumin, cayenne pepper, sugar, and salt).",
    "Cut the onion and bell peppers into 1/4-inch wide strips. Place them in a large 13x15-inch casserole dish or a large baking sheet. Slice the chicken breast into very thin strips and add it to the casserole dish with the vegetables.",
    "Drizzle the vegetable oil over the chicken and vegetables, then sprinkle the fajita seasoning mix over top. Use your hands to toss the ingredients until everything is well coated in oil and seasoning. Bake in the preheated oven for 35-40 minutes, stirring once half way through. Squeeze the juice from half of the lime over top of the meat and vegetables after they come out of the oven.",
    "While the fajita mix bakes, toast each tortilla in a dry skillet over medium-low heat, until lightly browned on each side. Scoop a small amount of meat and vegetables into the center of each tortilla. Top with a few sprigs of cilantro, a dollop of sour cream, and an extra squeeze of lime if desired."
  ]
}