{
  "title": "Easy Sesame Chicken",
  "rating": "7",
  "notes": [
    "breasts worked, but thighs actually not too bad"
  ],
  "source": "https://www.budgetbytes.com/easy-sesame-chicken/",
  "ingredients": [
    {
      "quantity": "1",
      "name": "large egg"
    },
    {
      "quantity": "2 Tbsp",
      "name": "cornstarch"
    },
    {
      "quantity": "1 pinch",
      "name": "each salt and pepper"
    },
    {
      "quantity": "1 lb",
      "name": "boneless skinless chicken thighs"
    },
    {
      "quantity": "2 Tbsp",
      "name": "cooking oil"
    },
    {
      "quantity": "1/4 cup",
      "name": "soy sauce"
    },
    {
      "quantity": "2 Tbsp",
      "name": "water"
    },
    {
      "quantity": "1 Tbsp",
      "name": "toasted sesame oil"
    },
    {
      "quantity": "3 Tbsp",
      "name": "brown sugar"
    },
    {
      "quantity": "1  Tbsp",
      "name": "rice vinegar"
    },
    {
      "quantity": "1 tsp",
      "name": "grated fresh ginger"
    },
    {
      "quantity": "2 cloves",
      "name": "garlic, minced"
    },
    {
      "quantity": "1 Tbsp",
      "name": "sesame seeds"
    },
    {
      "quantity": "1/2 Tbsp",
      "name": "cornstarch"
    },
    {
      "quantity": "4 cups",
      "name": "cooked jasmine rice"
    },
    {
      "quantity": "2",
      "name": "whole green onions"
    }
  ],
  "instructions": [
    "First, prepare the sauce. In a small bowl stir together the soy sauce, water, sesame oil, brown sugar, rice vinegar, fresh ginger, minced garlic, cornstarch, and sesame seeds. (Grate the ginger with a small-holed cheese grater). Set the sauce aside.",
    "In a large bowl, whisk together the egg, 2 Tbsp cornstarch, and a pinch of salt and pepper. Trim any excess fat from the chicken thighs, then cut them into small 1 inch pieces. Toss the chicken in the egg and cornstarch mixture.",
    "Add the cooking oil to a large skillet and heat it over medium flame. Wait until the skillet is very hot, then swirl the skillet to make sure the oil coats the entire surface. Add the batter coated chicken and spread it out into a single layer over the surface of the skillet. ",
    "Allow the chicken pieces to cook, undisturbed, until golden brown on the bottom. Then, carefully flip the chicken, breaking up the pieces into smaller clumps as you flip. Continue to cook the chicken until golden brown on the other side. Stir the chicken as little as possible to avoid breaking the egg coating from the surface of the chicken.",
    "Once the chicken is cooked through and golden brown on all sides, pour the sauce over top. Toss the chicken to coat in the sauce. As the sauce comes up to a simmer, it will begin to thicken. Continue to gently stir the chicken in the sauce until it has thickened, then turn off the heat.",
    "Serve the chicken over a bed of rice and sprinkle the sliced green onions over top."
  ]
}