{
  "title": "Enchilada Bubble Up Casserole",
  "slug": "enchilada-bubble-up-casserole",
  "rating": 5,
  "notes": [
    "biscuits are good, not a good combo with chicken"
  ],
  "source": "https://www.budgetbytes.com/2018/02/enchilada-bubble-casserole/",
  "ingredients": [
    {
      "quantity": "1 Tbsp",
      "name": "vegetable oil"
    },
    {
      "quantity": "1 Tbsp",
      "name": "flour"
    },
    {
      "quantity": "1 Tbsp",
      "name": "chili powder*"
    },
    {
      "quantity": "1 cup",
      "name": "water"
    },
    {
      "quantity": "2 Tbsp",
      "name": "tomato paste"
    },
    {
      "quantity": "1/4 tsp",
      "name": "cumin"
    },
    {
      "quantity": "1/4 tsp",
      "name": "garlic powder"
    },
    {
      "quantity": "1/8 tsp",
      "name": "cayenne pepper"
    },
    {
      "quantity": "",
      "name": "salt, to taste"
    },
    {
      "quantity": "1/4 cup",
      "name": "hot water"
    },
    {
      "quantity": "1 tsp",
      "name": "active dry or instant yeast"
    },
    {
      "quantity": "1.5 cups",
      "name": "all-purpose flour (plus some for dusting)"
    },
    {
      "quantity": "1/2 tsp",
      "name": "salt"
    },
    {
      "quantity": "2 tsp",
      "name": "baking powder"
    },
    {
      "quantity": "1 tsp",
      "name": "sugar"
    },
    {
      "quantity": "1 cup",
      "name": "heavy cream"
    },
    {
      "quantity": "2 cups",
      "name": "cooked chicken, shredded or chopped**"
    },
    {
      "quantity": "15 oz",
      "name": "can black beans, drained"
    },
    {
      "quantity": "1 cup",
      "name": "cheese, shredded"
    },
    {
      "quantity": "2",
      "name": "green onions, sliced"
    }
  ],
  "instructions": [
    "Begin the biscuit dough first, so it can rest for one hour. Dissolve the yeast into 1/4 cup hot water. Let that sit for a few minutes.",
    "In a large bowl, stir together the all-purpose flour, salt, baking powder, and sugar. Finally, add the heavy cream and yeast water, and stir until a sticky ball of dough forms.",
    "Dust the sticky dough with flour and then turn it out onto a well floured surface. Knead the dough for about three minutes, adding flour as you go to keep it from sticking. Form the dough into a ball, place it back in the bowl, cover it loosely with plastic, and let it rest for one hour.",
    "In the mean time, make the enchilada sauce. Add the oil, flour, and chili powder to a small sauce pot. Whisk the ingredients together and place over a medium burner. Allow the mixture to begin to sizzle and bubble, and continue to cook and whisk for about one minute.",
    "Carefully whisk in the water, tomato paste, cumin, garlic powder, and cayenne pepper. Allow the mixture to come up to a simmer again, at which point it will thicken. Remove it from the heat and add salt to taste. ",
    "Drain the black beans and add them to a bowl along with the cooked chicken. Add the enchilada sauce and stir them together until everything is coated.",
    "After the dough has been resting for one hour, begin to preheat the oven to 375ºF. Coat an 8x11\" or 2 quart casserole dish with non-stick spray.",
    "Take the dough out of the bowl and place it on a well floured surface. Press it down into a circle or rectangle, and then cut it into small, bite-sized pieces. Add the pieces to the bowl with the chicken, beans, and enchilada sauce, and carefully fold them together until evenly combined and coated in sauce.",
    "Spread the dough mixture into the casserole dish and make sure it's in an even layer across the bottom. The mixture should not be piled too thick. Cover the dish with foil and bake for 20 minutes. Remove the foil and bake for 10-15 minutes more, or until the center is baked through. ",
    "Add the shredded cheese, and bake for another 5-7 minutes. Top with sliced green onions just before serving."
  ]
}