{
  "title": "Garden Vegetable Turkey Loaf Meal Prep",
  "slug": "garden-vegetable-turkey-loaf-meal-prep",
  "image": "../images/garden-vegetable-turkey-loaf-meal-prep.jpg",
  "rating": 6,
  "notes": [
    "Decent, lots of vegetables to meat ratio.  Also takes way longer to cook because of vegetable water content",
    "Use with the will it skillet? mac and cheese recipe"
  ],
  "createdDate": "08/18/2019",
  "source": "https://www.budgetbytes.com/garden-vegetable-turkey-loaf-meal-prep/",
  "ingredients": [
    {
      "category": "Meatloaf",
      "items": [
        "1 Tbsp olive oil",
        "1 small onion",
        "1 clove garlic",
        "2 medium carrots",
        "1 small zucchini",
        "8 oz button mushrooms",
        "3/4 tsp salt",
        "Freshly cracked pepper",
        "1 Tbsp Worcestershire sauce",
        "1/4 cup ketchup",
        "1 large egg",
        "3/4 cup plain breadcrumbs",
        "19 oz package ground turkey 93% lean*"
      ]
    },
    {
      "category": "Mac and Cheese",
      "items": [
        "1/2 tsp salt ",
        "2 cups elbow macaroni* ",
        "2 Tbsp butter ",
        "3/4 cup evaporated milk ",
        "1/2 tsp Dijon mustard ",
        " Pinch of cayenne pepper ",
        "1.5 cups shredded sharp cheddar "
      ]
    },
    {
      "category": "Vegetables",
      "items": [
        "Grean beans"
      ]
    }
  ],
  "instructions": [
    "Dice the onion and mince the garlic. Sauté both in a large skillet with 1 Tbsp olive oil over medium heat until soft and transparent. Peel the carrots, then use a large holed cheese grater to shred them into the skillet. Cut the ends off the zucchini and shred it into the skillet as well. Continue to sauté over medium heat.",
    "While the onion, garlic, carrots, and zucchini are sautéing, roughly chop the mushrooms. Add the mushrooms to the skillet and season with 3/4 tsp salt and a generous dose of freshly cracked pepper. Continue to sauté the vegetables over medium heat until they release all of their moisture and it has evaporated from the bottom of the skillet (there should be no juices pooling on the bottom of the skillet).",
    "After the vegetables have sautéed and are mostly dry, transfer them to a bowl and let them cool for 5-10 minutes. Begin to preheat the oven to 375 degrees and coat the wells of a muffin tin with non-stick spray.",
    "Once the vegetables have cooled some, add the Worcestershire sauce, ketchup, egg, and breadcrumbs to the bowl. Mix these ingredients well until they are evenly combined. Add the ground turkey and use your hands to gently mix it into the vegetable mixture. Try to avoid over mixing.",
    "Evenly divide the meat mixture between the 12 cups of a muffin tin. Bake the mini loaves in the preheated 375 degree oven for 30 minutes.",
    "While the loaves are baking, mix the tomato glaze. Combine the ketchup, brown sugar, and apple cider vinegar in a small bowl and stir until smooth. Once the loaves have baked for 15 minutes, spoon the glaze over the muffins and let them bake with the glaze for the remaining 15 minutes.",
    "Allow the loaves to rest for 5 to 10 minutes before carefully running a knife around their outer edges and lifting out of the tin with a fork. The rest time will help solidify the loaves and keep them in one piece."
  ]
}