{
  "title": "Garlic Herb Baked Chicken Breast",
  "slug": "garlic-herb-baked-chicken-breast",
  "rating": "7",
  "notes": [
    "Use more butter next time, had a hard time covering 2 breasts butterflied"
  ],
  "source": "https://www.budgetbytes.com/garlic-herb-baked-chicken-breast/",
  "ingredients": [
    {
      "quantity": "2 Tbsp",
      "name": "butter, room temperature"
    },
    {
      "quantity": "1 tsp",
      "name": "dried parsley"
    },
    {
      "quantity": "1/2  tsp",
      "name": "dried oregano"
    },
    {
      "quantity": "1/2  tsp",
      "name": "dried basil"
    },
    {
      "quantity": "1/4 tsp",
      "name": "garlic powder"
    },
    {
      "quantity": "1/4 tsp",
      "name": "onion powder"
    },
    {
      "quantity": "1/4 tsp",
      "name": "salt"
    },
    {
      "quantity": "",
      "name": "freshly cracked pepper"
    },
    {
      "quantity": "2",
      "name": "boneless, skinless chicken breasts (about .5 lbs. each)"
    }
  ],
  "instructions": [
    "Preheat the oven to 400ºF. Stir together the butter, parsley, oregano, basil, garlic powder, onion powder, salt, and some freshly cracked pepper (about 15 cranks of a pepper mill) until well combined and paste-like in texture.",
    "If your chicken breasts are thicker than 3/4\" at their thickest end, place them on a cutting board, cover with plastic, then gently pound the thick end until it is between 1/2-3/4\" thick. Pat the chicken dry with a paper towel.",
    "Place the chicken breasts on a baking sheet or in a casserole dish, making sure they are not crowded (a couple of inches of space between and around each breast). Spread garlic herb butter over the surface of each breast. ",
    "Place the chicken in the oven and bake for 20 minutes. The total cooking time may vary with the size and thickness of the chicken breast, so use a meat thermometer to ensure the internal temperature of the thickest end of the breast has reached 165ºF.",
    "Once the chicken has baked through, let it rest for about 5 minutes before slicing and serving."
  ]
}