{
  "title": "Pasta with 5 Ingredient Butter Tomato Sauce",
  "servings": 4,
  "time": [
    {
      "label": "Prep",
      "units": "5 minutes"
    },
    {
      "label": "Cook",
      "units": "45 minutes"
    },
    {
      "label": "Total",
      "units": "50 minutes"
    }
  ],
  "slug": "pasta-with-5-ingredient-butter-tomato-sauce",
  "image": "../images/pasta-with-5-ingredient-butter-tomato-sauce.jpg",
  "rating": 7,
  "notes": [
    "Toasted breadcrumbs don't really add much (plus a half a cup is a lot of breadcrumbs)"
  ],
  "source": "https://www.budgetbytes.com/pasta-5-ingredient-butter-tomato-sauce/",
  "ingredients": [
    {
      "category": "TOASTED BREAD CRUMBS (optional)",
      "items": [
        "2 Tbsp olive oil",
        "1/2 cup breadcrumbs ",
        "1/4 tsp salt ",
        "1/2 tsp dried oregano ",
        " Freshly cracked Pepper "
      ]
    },
    {
      "category": "PASTA WITH BUTTER TOMATO SAUCE",
      "items": [
        "8 oz. pasta ",
        "4 Tbsp salted butter ",
        "3 cloves garlic ",
        "28 oz. can whole peeled tomatoes* ",
        "1/2 tsp salt (or to taste)",
        " Freshly cracked pepper "
      ]
    }
  ],
  "instructions": [
    "To make the toasted bread crumbs, heat the olive oil in a large skillet over medium heat. Once the oil is shimmering, add the bread crumbs, salt, oregano, and some freshly cracked pepper. Cook and stir the bread crumbs continuously until they achieve a deep golden color. Remove them from the skillet and let cool until ready to use.",
    "To make the sauce, mince the garlic and add it to a large deep skillet with the butter. Sauté the garlic in the butter over medium heat for about a minute, or just until it becomes fragrant. Add the can of tomatoes, along with all the juices, and some freshly cracked pepper. Break the tomatoes up into a few chunks with your spoon (they should be soft and easily crushed).",
    "Stir the ingredients in the skillet, then let it come up to a simmer. Once it reaches a simmer, reduce the heat to medium-low and let it continue to simmer, without a lid, for about 30 minutes. Stir the sauce occasionally as it simmers, breaking the tomatoes into smaller pieces as you stir.",
    "While the sauce simmers, cook the pasta according to the package directions. Save about 1/2 cup of the starchy cooking water before draining the pasta in a colander.",
    "After simmering for 30 minutes, the sauce should have thickened and become slightly less acidic and slightly more sweet. Season the sauce with a final 1/2 tsp of salt (or to your liking). Add the cooked and drained pasta to the sauce and toss to coat. Use some of the reserved starchy cooking water to loosen the pasta if it becomes too dry. Top the pasta and sauce with a generous sprinkle of toasted bread crumbs, then serve."
  ],
  "createdDate": "12/17/2020"
}