{
    "title": "Pressure Cooker American Beef Stew Recipe",
    "rating": 9,
    "notes": [
        "takes a while, but very good, might be worth to try the dutch oven version"
    ],
    "source": "https://www.seriouseats.com/recipes/2016/10/pressure-cooker-beef-stew-recipe.html",
    "ingredients": [
        {
            "quantity": "3 Cups",
            "name": "Chicken stock"
        },
        {
            "quantity": "4 Packets",
            "name": "Unflavored gelatin"
        },
        {
            "quantity": "3 Tbsp",
            "name": "Tomato paste"
        },
        {
            "quantity": "1 Tbsp",
            "name": "Soy Sauce"
        },
        {
            "quantity": "1 Tbsp",
            "name": "Fish sauce"
        },
        {
            "quantity": "1 Tbsp",
            "name": "Worcestershire sauce"
        },
        {
            "quantity": "2 Tbsp",
            "name": "Vegetable oil"
        },
        {
            "quantity": "3 Lbs",
            "name": "Whole boneless beef chuck roast, cut into 3 steaks"
        },
        {
            "quantity": "10 Oz",
            "name": "White button mushrooms"
        },
        {
            "quantity": "4",
            "name": "Carrots"
        },
        {
            "quantity": "8 Oz",
            "name": "Pearl onions"
        },
        {
            "quantity": "1",
            "name": "Yellow onion, unpeeled, cut in half"
        },
        {
            "quantity": "2 Stalks",
            "name": "Celery"
        },
        {
            "quantity": "3 Cloves",
            "name": "Garlic"
        },
        {
            "quantity": "1 Cup",
            "name": "Dry red wine"
        },
        {
            "quantity": "2 Tbsp",
            "name": "Flour"
        },
        {
            "quantity": "2",
            "name": "Bay leaves"
        },
        {
            "quantity": "4 Sprigs",
            "name": "Thyme"
        },
        {
            "quantity": "1 Lb",
            "name": "Yukon gold potatoes, peeled and cubed"
        },
        {
            "quantity": "4 Oz",
            "name": "Frozen peas"
        }
    ],
    "instructions": [
        "Combine stock, gelatin, tomato paste, soy sauce, anchovies or fish sauce, and Worcestershire sauce in a blender and blend on high speed until homogeneous. Set aside",
        "In a pressure cooker, heat oil over medium-high heat until shimmering. Season beef all over with salt and pepper and add to pressure cooker, working in batches if necessary (beef should fit in a single layer). Cook, turning occasionally, until beef is well browned on 2 sides, about 10 minutes. Transfer beef to a rimmed baking sheet or large plate and set aside.",
        "Add mushrooms to pressure cooker and cook, stirring, until liquid is released and mushrooms begin to brown, about 6 minutes, lowering heat as necessary to prevent scorching. Add chopped carrots and pearl onions and cook, stirring, until well browned on all sides, a few minutes longer. Season to taste with salt and pepper, then transfer to a bowl and set aside.",
        "Add halved yellow onion to pressure cooker, cut side down. Add whole carrots, celery ribs, and garlic. Cook, turning carrots, celery, and garlic occasionally, until all vegetables are well browned, about 4 minutes.",
        "Add wine or sherry, scrape up browned bits with a wooden spoon, and cook until reduced by three-quarters, about 3 minutes. Add reserved stock mixture.",
        "Cut seared steaks into 1 1/2– to 2-inch chunks and transfer to a large bowl. Toss with flour. Add beef and any juices accumulated in the tray or plate to pressure cooker, along with bay leaves and thyme sprigs. Stir to combine, seal pressure cooker, and bring to high pressure. Cook for 30 minutes, then rapidly release pressure and open cooker.",
        "Using tongs, fish out and discard carrot, celery, thyme, bay leaves, onion, and garlic. Add potatoes and reserved sautéed mushrooms, pearl onions, and carrots to stew, reseal cooker, bring to high pressure, and cook 15 minutes longer. Rapidly release pressure.",
        "Stir in peas. Season to taste with salt and pepper if necessary. Serve immediately, or let cool overnight or for up to 5 days and reheat to serve."
    ]
}