{
  "title": "Salisbury Steak with Mushroom Gravy",
  "slug": "salisbury-steak-with-mushroom-gravy",
  "image": "../images/salisbury-steak-with-mushroom-gravy.jpg",
  "rating": 8,
  "notes": [
    ""
  ],
  "source": "https://www.budgetbytes.com/salisbury-steak-with-mushroom-gravy/",
  "ingredients": [
    {
      "category": "All",
      "items": [
        "1 yellow onion, divided",
        "1 lb. ground beef",
        "1/2 cup breadcrumbs",
        "1 large egg",
        "2 Tbsp Worcestershire sauce, divided",
        "1 tsp Italian seasoning",
        "1/2 tsp salt",
        "1/4 tsp pepper",
        "1 Tbsp cooking oil",
        "8 oz. mushrooms",
        "2 Tbsp butter",
        "2 Tbsp all-purpose flour",
        "1.5 cups beef broth*",
        " salt and pepper to taste"
      ]
    }
  ],
  "instructions": [
    "Finely mince about ½ cup of the onion and slice the remainder of the onion. The minced onion will go in the ground beef mixture, the rest will be used for the gravy. ",
    "Add the ground beef, minced onion, breadcrumbs, egg, 1 Tbsp of the Worcestershire sauce (the remainder will go in the gravy), Italian seasoning, salt, and pepper to a large bowl. Use your hands to mix the ingredients together until they are evenly combined. Divide the mixture into four equal parts, and shape each into a flattened oval.",
    "Add the cooking oil to a large skillet and heat over medium. Once the skillet is hot, add the shaped beef patties and cook for about 5 minutes on each side, or until they are well browned on each side. Transfer the cooked patties to a clean plate.",
    "While the beef patties are cooking, slice the mushrooms. After removing the beef from the skillet, add the sliced mushrooms and the remaining sliced onion along with a pinch of salt and pepper. Continue to cook the mushrooms and onions over medium until they are soft. Allow the moisture released from the onions and mushrooms to help you dissolve any browned bits off the bottom of the skillet as you stir.",
    "Once the mushrooms and onions have softened and most of the moisture has evaporated off the bottom of the skillet, add the butter and flour. Continue to stir and cook for about two minutes. The flour and butter will form a paste and begin to coat the bottom of the skillet.",
    "Add the beef broth and one tablespoon of Worcestershire sauce to the skillet. Stir to dissolve the flour into the broth, making sure to dissolve any flour that is stuck to the bottom of the skillet. Allow the broth to come up to simmer (still over medium heat), stirring often. Once it reaches a simmer, it will thicken into a gravy.",
    "Once the gravy is simmering, add the beef patties back to the skillet with the broth, mushrooms, and onions. Spoon the gravy over top, and continue to simmer the beef in the gravy for an additional five minutes. Taste the gravy and adjust the salt and pepper to your liking."
  ],
  "createdDate": "7/11/2020",
  "servings": 4,
  "time": [
    {
      "label": "Prep",
      "units": "10 minutes"
    },
    {
      "label": "Cook",
      "units": "30 minutes"
    },
    {
      "label": "Total",
      "units": "40 minutes"
    }
  ]
}