{
  "title": "Sheet Pan BBQ Meatloaf Dinner",
  "slug": "sheet-pan-bbq-meatloaf-dinner",
  "rating": "7",
  "notes": [
    "the only meatloaf recipe I should be using"
  ],
  "source": "https://www.budgetbytes.com/2018/01/sheet-pan-bbq-meatloaf-dinner/",
  "ingredients": [
    {
      "quantity": "1",
      "name": "sweet potato (about 1 lb.)"
    },
    {
      "quantity": "12 oz.",
      "name": "frozen broccoli florets"
    },
    {
      "quantity": "2 Tbsp",
      "name": "olive oil"
    },
    {
      "quantity": "1/2 tsp",
      "name": "seasoning salt*"
    },
    {
      "quantity": "",
      "name": "salt and pepper to taste"
    },
    {
      "quantity": "1/2 lb.",
      "name": "ground beef"
    },
    {
      "quantity": "1 large",
      "name": "egg"
    },
    {
      "quantity": "2 Tbsp",
      "name": "bread crumbs"
    },
    {
      "quantity": "3 Tbsp",
      "name": "BBQ sauce, divided"
    },
    {
      "quantity": "1/4 tsp",
      "name": "smoked paprika"
    },
    {
      "quantity": "1/8 tsp ",
      "name": "garlic powder"
    },
    {
      "quantity": "1/4 tsp ",
      "name": "salt"
    }
  ],
  "instructions": [
    "Preheat the oven to 400ºF. Peel the sweet potato and cut it into 1/2 to 3/4\" cubes. Place the sweet potatoes and frozen broccoli florets (no need to thaw) on a large baking sheet.",
    "Drizzle the olive oil over the sweet potatoes and broccoli florets. Sprinkle the seasoning salt over the sweet potatoes and then season the broccoli florets with a pinch of salt and pepper. Use your hands to toss the vegetables until they are coated in oil and spices, keeping the sweet potatoes on one side of the baking sheet and the broccoli on the other.",
    "Transfer the baking sheet to the preheated oven and roast the vegetables for 15 minutes.",
    "While the vegetables are roasting, prepare the meatloaves. In a medium bowl combine the ground beef, egg, bread crumbs, 1 Tbsp of the BBQ sauce, the smoked paprika, garlic powder, and salt. Work the ingredients together with your hands or a fork until they are well combined. Divide the meatloaf mixture in two and shape each half into a flattened oval.",
    "After the vegetables have roasted for 15 minutes, remove the baking sheet and stir each of the vegetables. Push each off to the side a bit to make room for the meatloaves. Place the shaped meatloaves in the center and then spread 1 Tbsp of BBQ sauce over each loaf.",
    "Return the baking sheet to the oven and roast for an additional 20 minutes, or until the internal temperature of the meatloaves has reached 160ºF. Remove the baking sheet from the oven, plate up the meatloaves and vegetables, and serve immediately."
  ]
}