{
  "title": "Smoky Roasted Sausage and Vegetables",
  "slug": "smoky-roasted-sausage-and-vegetables",
  "image": "../images/smoky-roasted-sausage-and-vegetables.jpg",
  "rating": 5,
  "notes": [
    "High cal, lots of flavor (from sausage)"
  ],
  "createdDate": "03/11/2020",
  "source": "https://www.budgetbytes.com/smoky-roasted-sausage-and-vegetables/",
  "ingredients": [
    {
      "category": "All",
      "items": [
        "1/4 cup olive oil",
        "2 Tbsp red wine vinegar",
        "1 tsp coarse deli mustard (or Dijon)",
        "1/4 tsp garlic powder",
        "1/4 tsp dried oregano",
        "1/2 tsp smoked paprika",
        "1/4 tsp salt",
        " freshly cracked black pepper",
        "1/4 tsp sugar",
        "12 oz. smoked sausage",
        "1 lb. broccoli crown",
        "1 bell pepper (any color)",
        "1 red onion",
        "1 cup long grain white rice (uncooked)",
        "1  handful chopped parsley"
      ]
    }
  ],
  "instructions": [
    "Preheat the oven to 400ºF. Line a large baking sheet with parchment paper.",
    "In a small bowl or jar combine the ingredients for the vinaigrette (olive oil, red wine vinegar, mustard, garlic powder, dried oregano, smoked paprika, salt, pepper, and sugar). Whisk the ingredients together or close the jar and shake until combined. Set the vinaigrette aside.",
    "Slice the smoked sausage into 1/2-inch medallions. Cut the broccoli into small florets. Dice the bell pepper and onion into 1-inch pieces. Place the sausage, broccoli, bell pepper, and onion onto the baking sheet.",
    "Drizzle 2 Tbsp of the vinaigrette over the sausage and vegetables and toss to coat.",
    "Roast the vegetables in the fully preheated oven for 35-40 minutes, or until they're browned on the edges, stirring once half way through.",
    "While the sausage and vegetables are roasting, cook the rice. Add the rice and 2 cups water to a sauce pot. Place a lid on the pot and bring it up to a boil over high heat. Once boiling, turn the heat down to low and let simmer for 15 minutes. After 15 minutes, turn the heat off and let it rest, undisturbed, lid in place, for an additional 5 minutes. Fluff with a fork just before serving.",
    "After the sausage and vegetables have finished roasting, add half of the remaining vinaigrette and toss to coat. Season with an extra pinch of salt and pepper if needed.",
    "To serving, add about 3/4 cup rice to each bowl or container along with 1/4 of the roasted sausage and vegetables. Drizzle another spoonful of the vinaigrette over top, then finish with a sprinkle of fresh parsley."
  ]
}