{
  "title": "Spicy Baked Black Bean Nachos",
  "slug": "spicy-baked-black-bean-nachos",
  "rating": 7,
  "notes": [
    ""
  ],
  "source": "https://www.budgetbytes.com/2017/04/spicy-baked-black-bean-nachos/",
  "ingredients": [
    {
      "quantity": "1 Tbsp",
      "name": "olive oil"
    },
    {
      "quantity": "1",
      "name": "small onion "
    },
    {
      "quantity": "10 oz",
      "name": "can petite diced tomatoes with green chiles"
    },
    {
      "quantity": "15 oz",
      "name": "can black beans"
    },
    {
      "quantity": "1/2 tsp",
      "name": "chipotle powder "
    },
    {
      "quantity": "1/2 tsp",
      "name": "cumin "
    },
    {
      "quantity": "1/4 tsp",
      "name": "garlic powder "
    },
    {
      "quantity": "1/4 tsp",
      "name": "salt "
    },
    {
      "quantity": "8 oz",
      "name": "sturdy corn tortilla chips "
    },
    {
      "quantity": "4 oz",
      "name": "cheddar, shredded*"
    },
    {
      "quantity": "1",
      "name": "Roma tomato"
    },
    {
      "quantity": "1",
      "name": "jalapeño"
    },
    {
      "quantity": "1/3 cup",
      "name": "pickled red onions "
    },
    {
      "quantity": "",
      "name": "Handful cilantro"
    },
    {
      "quantity": "1/4 cup",
      "name": "sour cream"
    }
  ],
  "instructions": [
    "Finely dice the onion. Add the olive oil and onion to a large skillet and sauté over medium heat until the onion is soft and transparent (about 5 minutes). Drain, but do not rinse the black beans, allowing some of the starchy liquid to remain coating the beans. Add the beans and diced tomatoes with chiles (not drained) to the skillet, along with the chipotle powder, cumin, garlic powder, and salt. Stir and simmer the mixture until it thickens and liquid no longer pools on the bottom of the skillet (about 10 minutes).",
    "Begin preheating the oven to 350ºF. Shred the cheddar cheese, finely dice the Roma tomato, thinly slice the jalapeño, and chop the cilantro.",
    "Line a baking sheet with parchment or foil. Spread a layer of tortilla chips over the baking sheet in a single layer, trying not to overlap the chips. Spoon about half of the black bean mixture over the chips, then sprinkle half of the shredded cheese over top. Repeat with one more layer of chips, black beans, and cheese.",
    "Bake the chips, beans, and cheese for 5-7 minutes, or until the cheese is fully melted and the chips are just beginning to turn golden brown on the edges. Remove the nachos from the oven and add a drizzles or dollops of sour cream over top. Sprinkle the diced tomato, sliced jalapeño, pickled red onions, and chopped cilantro over top."
  ]
}